#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/msafaric-demo/civo-k8s-demo/runs/run-egi1LxDnabbhMgxG

Waiting for the plan to start...

Terraform v1.0.11
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # civo_firewall.kubernetes-cluster will be created
  + resource "civo_firewall" "kubernetes-cluster" {
      + id         = (known after apply)
      + name       = "kubernetes-cluster"
      + network_id = (known after apply)
    }

  # civo_firewall_rule.kube-api will be created
  + resource "civo_firewall_rule" "kube-api" {
      + cidr        = [
          + "0.0.0.0/0",
        ]
      + direction   = "ingress"
      + end_port    = "6443"
      + firewall_id = (known after apply)
      + id          = (known after apply)
      + label       = "kubernetes-api-server"
      + protocol    = "tcp"
      + region      = (known after apply)
      + start_port  = "6443"
    }

  # civo_kubernetes_cluster.knative-eventing-cluster will be created
  + resource "civo_kubernetes_cluster" "knative-eventing-cluster" {
      + api_endpoint           = (known after apply)
      + created_at             = (known after apply)
      + dns_entry              = (known after apply)
      + firewall_id            = (known after apply)
      + id                     = (known after apply)
      + installed_applications = (known after apply)
      + instances              = (known after apply)
      + kubeconfig             = (sensitive value)
      + kubernetes_version     = (known after apply)
      + master_ip              = (known after apply)
      + name                   = "knative-eventing-cluster"
      + network_id             = (known after apply)
      + num_target_nodes       = 1
      + pools                  = (known after apply)
      + ready                  = (known after apply)
      + region                 = (known after apply)
      + status                 = (known after apply)
      + target_nodes_size      = "g3.k3s.xsmall"
    }

Plan: 3 to add, 0 to change, 0 to destroy.


```
</details>
*Pusher: @mirsafari, Action: `pull_request`*